modules/about/vm/README.md
```mermaid
graph TD
aboutdata["about:data"]
aboutvm["about:vm"]
apigithub["api:github"]
codegenannotation["codegen:annotation"]
coredi["core:di"]
coremodel["core:model"]
logging["logging"]
style aboutdata fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style aboutvm fill:#F5A6A6,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style apigithub fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style codegenannotation fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style coredi fill:#FCB103,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style coremodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style logging fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
aboutdata --> apigithub
aboutvm --> aboutdata
aboutvm --> coredi
aboutvm -.-> logging
apigithub -.-> codegenannotation
apigithub --> coremodel
```
