modules/about/vm/modules.dot
digraph {
edge ["dir"="forward"]
graph ["dpi"="100","label"=":about:vm","labelloc"="t","fontsize"="30","ranksep"="1.5","rankdir"="TB"]
node ["style"="filled"]
":about:data" ["fillcolor"="#9D8DF1","shape"="none"]
":about:vm" ["fillcolor"="#F5A6A6","color"="black","penwidth"="3","shape"="box"]
":api:github" ["fillcolor"="#9D8DF1","shape"="none"]
":codegen:annotation" ["fillcolor"="#9D8DF1","shape"="none"]
":core:di" ["fillcolor"="#FCB103","shape"="none"]
":core:model" ["fillcolor"="#9D8DF1","shape"="none"]
":logging" ["fillcolor"="#9D8DF1","shape"="none"]
{
edge ["dir"="none"]
graph ["rank"="same"]
":about:vm"
}
":about:data" -> ":api:github"
":about:vm" -> ":about:data"
":about:vm" -> ":core:di"
":about:vm" -> ":logging" ["style"="dotted"]
":api:github" -> ":codegen:annotation" ["style"="dotted"]
":api:github" -> ":core:model"
}
